# Advanced Aggregate Functions

* aggregate
* filter
* transform
* apply

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
        {
            'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
            'variable1': np.random.rand(1, 6)[0] * 100,
            'variable2': np.random.rand(1, 6)[0] * 100,
        }
)

In [3]:
df

  groups  variable1  variable2
0      A  15.746002  88.579253
1      B  83.061379  99.503831
2      C  57.945894  96.763537
3      A  22.450263   6.531330
4      B  30.849200  46.735116
5      C  78.545402  69.980675

In [4]:
df.groupby('groups').describe().T

groups                   A          B          C
variable1 count   2.000000   2.000000   2.000000
          mean   19.098133  56.955290  68.245648
          std     4.740629  36.919585  14.566052
          min    15.746002  30.849200  57.945894
          25%    17.422067  43.902245  63.095771
          50%    19.098133  56.955290  68.245648
          75%    20.774198  70.008334  73.395525
          max    22.450263  83.061379  78.545402
variable2 count   2.000000   2.000000   2.000000
          mean   47.555292  73.119473  83.372106
          std    58.016643  37.313117  18.938343
          min     6.531330  46.735116  69.980675
          25%    27.043311  59.927294  76.676391
          50%    47.555292  73.119473  83.372106
          75%    68.067272  86.311652  90.067821
          max    88.579253  99.503831  96.763537

### Aggregate

In [5]:
df.groupby('groups').aggregate(['std', np.median, 'max']).T

groups                    A          B          C
variable1 std      4.740629  36.919585  14.566052
          median  19.098133  56.955290  68.245648
          max     22.450263  83.061379  78.545402
variable2 std     58.016643  37.313117  18.938343
          median  47.555292  73.119473  83.372106
          max     88.579253  99.503831  96.763537

In [6]:
df.groupby('groups').aggregate({'variable1': 'min', 'variable2': np.median})

        variable1  variable2
groups
A       15.746002  47.555292
B       30.849200  73.119473
C       57.945894  83.372106

### Filter

In [7]:
def filter_func(x):
    return x['variable1'].std() > 12

In [8]:
df.groupby('groups').std().T

groups             A          B          C
variable1   4.740629  36.919585  14.566052
variable2  58.016643  37.313117  18.938343

In [9]:
df.groupby('groups').filter(filter_func)

  groups  variable1  variable2
1      B  83.061379  99.503831
2      C  57.945894  96.763537
4      B  30.849200  46.735116
5      C  78.545402  69.980675

### Transform

In [10]:
df

  groups  variable1  variable2
0      A  15.746002  88.579253
1      B  83.061379  99.503831
2      C  57.945894  96.763537
3      A  22.450263   6.531330
4      B  30.849200  46.735116
5      C  78.545402  69.980675

In [11]:
df_a = df.iloc[:, 1:3]
df_a

   variable1  variable2
0  15.746002  88.579253
1  83.061379  99.503831
2  57.945894  96.763537
3  22.450263   6.531330
4  30.849200  46.735116
5  78.545402  69.980675

In [12]:
df_a.transform(lambda x: (x - x.mean()) / x.std())

   variable1  variable2
0  -1.109926   0.571307
1   1.199396   0.874817
2   0.337784   0.798686
3  -0.879929  -1.708180
4  -0.591795  -0.591223
5   1.044471   0.054594

### Apply

In [13]:
df_a

   variable1  variable2
0  15.746002  88.579253
1  83.061379  99.503831
2  57.945894  96.763537
3  22.450263   6.531330
4  30.849200  46.735116
5  78.545402  69.980675

In [14]:
df_a.apply(np.sum)

variable1    288.598140
variable2    408.093742
dtype: float64

In [15]:
df_a.apply(np.median)

variable1    44.397547
variable2    79.279964
dtype: float64

In [16]:
df_a.apply('std')

variable1    29.149417
variable2    35.994034
dtype: float64

In [17]:
def my_func(value):
    return True if value > 25 else False

In [18]:
df_a

   variable1  variable2
0  15.746002  88.579253
1  83.061379  99.503831
2  57.945894  96.763537
3  22.450263   6.531330
4  30.849200  46.735116
5  78.545402  69.980675

In [19]:
df_a.variable1.apply(my_func)

0    False
1     True
2     True
3    False
4     True
5     True
Name: variable1, dtype: bool

In [20]:
df_a[df_a.variable1.apply(my_func)]

   variable1  variable2
1  83.061379  99.503831
2  57.945894  96.763537
4  30.849200  46.735116
5  78.545402  69.980675